In [1]:
import pandas as pd
import numpy as np

In [8]:
math_data = pd.read_csv("student-mat.csv")
math_data = math_data.rename({'G1' : 'math_G1', 'G2' : 'math_G2', 'G3' : 'math_G3'}, axis=1)
math_data["subject"] = "math"
por_data = pd.read_csv("student-por.csv")
por_data = por_data.rename({'G1' : 'por_G1', 'G2' : 'por_G2', 'G3' : 'por_G3'}, axis=1)
por_data["subject"] = "por"
data = pd.concat([math_data, por_data], sort=False)

In [13]:
def addTogether(gr):
    if len(gr) == 2 :
        df1 = pd.DataFrame(gr.iloc[[0]])
        df2 = pd.DataFrame(gr.iloc[[1]])
        return (df1.merge(df2, how='outer'))
    else:
        return gr

In [14]:
temp = data.groupby(["school","sex","age","address","famsize","Pstatus","Medu","Fedu","Mjob","Fjob","reason","nursery","internet"])

In [15]:
data = temp.apply(addTogether).reset_index(drop=True)

In [18]:
data

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,Walc,health,absences,math_G1,math_G2,math_G3,subject,por_G1,por_G2,por_G3
0,GP,F,15,R,GT3,T,1,1,at_home,other,...,1,1,4,NaN,NaN,NaN,por,13.0,13.0,13.0
1,GP,F,15,R,GT3,T,1,1,other,other,...,1,1,2,NaN,NaN,NaN,por,8.0,9.0,9.0
2,GP,F,15,R,GT3,T,1,1,other,other,...,4,5,2,NaN,NaN,NaN,por,13.0,11.0,11.0
3,GP,F,15,R,GT3,T,2,2,at_home,other,...,1,2,8,NaN,NaN,NaN,por,14.0,13.0,12.0
4,GP,F,15,R,GT3,T,2,4,services,health,...,1,5,2,NaN,NaN,NaN,por,10.0,11.0,10.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
679,MS,M,19,U,GT3,T,3,2,at_home,services,...,1,3,4,NaN,NaN,NaN,por,6.0,11.0,9.0
680,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,5,5,8.0,9.0,9.0,math,NaN,NaN,NaN
681,MS,M,20,R,GT3,T,1,1,other,other,...,4,4,12,NaN,NaN,NaN,por,8.0,11.0,10.0
682,MS,M,20,U,LE3,A,2,2,services,services,...,5,4,11,9.0,9.0,9.0,math,NaN,NaN,NaN
683,MS,M,21,R,GT3,T,1,1,other,other,...,3,3,3,10.0,8.0,7.0,math,NaN,NaN,NaN

In [66]:
df1 = pd.DataFrame({'one' : ['hi'], 'two' : ['dd'], 'three' : [''], 'four' : ['four']})
df2 = pd.DataFrame({'one' : ['hi'], 'two' : [''], 'three' : ['fgh'],'four' : ['four'] })
df1.merge(df2, on = ['one', 'four', 'three','two'], how = 'outer')

  one two three  four
0  hi  dd        four
1  hi       fgh  four